app/Models/Document.php

    public function lastAssignment(): Attribute
    {
        return Attribute::make(
            get: fn() => $this->transactions()->latest('id')->first()->employee_id,
        );
---
select * from `transactions` where `transactions`.`document_id` = 6 and `transactions`.`document_id` is not null order by `id` desc limit 1