app/Http/Controllers/Admin/DashboardStatController.php

select count(*) as aggregate from `documents`
---
    public function documents()
    {
        $totalDocumentsCount = Document::query()
            ->when(request('status') === 'active', function ($query) {
                $query->where('status', DocumentStatus::ACTIVE);
            })
            ->when(request('status') === 'archived', function ($query) {
                $query->where('status', DocumentStatus::ARCHIVED);
            })
            ->count();

select count(*) as aggregate from `transactions` where (`status` = 2 and `employee_id` = 16 and `type` is null)
select count(*) as aggregate from `documents` where DATEDIFF('2023-09-07 07:23:02',date_received) > 30 and `status` = 1
---
    public function to_do()
    {
        $current_user = Auth::user()->employee_id;
        $totalToReceiveCount = Transaction::query()
            ->where([['status', TransactionStatus::PENDING], ['employee_id', $current_user], ['type', null]])
            ->whereHas('document', function ($query) {
                $query->where('status', DocumentStatus::ACTIVE);
            })
            ->distinct('document_id')
            ->count();

        $totalToReleaseCount = Transaction::query()
            ->where([
                ['status', TransactionStatus::PENDING],
                ['employee_id', $current_user],
                ['type', TransactionType::RECEIVED]
            ])
            ->whereHas('document', function ($query) {
                $query->where('status', DocumentStatus::ACTIVE);
            })
            ->distinct('document_id')
            ->count('document_id');