app/Http/Controllers/Admin/DashboardStatController.php

select count(*) as aggregate from `users` where `created_at` between '2024-02-27 00:00:00' and '2024-02-27 01:01:45'
---
    public function users(){
        $totalUsersCount = User::query()
            ->when(request('date_range') === 'today', function($query) {
                $query->whereBetween('created_at', [now()->today(), now()]);
            })
            ->when(request('date_range') === '30_days', function($query) {
                $query->whereBetween('created_at', [now()->subDays(30), now()]);
            })
            ->when(request('date_range') === '60_days', function($query) {
                $query->whereBetween('created_at', [now()->subDays(60), now()]);
            })
            ->when(request('date_range') === '360_days', function($query) {
                $query->whereBetween('created_at', [now()->subDays(360), now()]);
            })
            ->when(request('date_range') === 'month_to_date', function($query) {
                $query->whereBetween('created_at', [now()->firstOfMonth(), now()]);
            })
            ->when(request('date_range') === 'year_to_date', function($query) {
                $query->whereBetween('created_at', [now()->firstOfYear(), now()]);
            })
            ->count();