app/Http/Controllers/Admin/DocumentStatusController.php

select count(*) as aggregate from `documents` where `status` = 1
---
    public function getStatusWithCount(){
        $searchQuery = request('query_search');
        $searchbyQuery = request('query_searchby');

        $cases = DocumentStatus::cases();
        return collect($cases)->map(function($status) use($searchQuery,$searchbyQuery){
            return [
                'name' => $status->name,
                'value' => $status->value,
                'count' => Document::where('status', $status->value)
                ->when(request('query_search'), function($query) use ($searchQuery,$searchbyQuery){
                            $query->when($searchbyQuery === 'client', function ($query) use ($searchQuery){
                                $query->whereHas('client', function($query) use($searchQuery){
                                    $query->where('name','like',"%{$searchQuery}%");
                                });
                            });
                            $query->when($searchbyQuery === 'title' || $searchbyQuery === 'description', function($query) use($searchQuery,$searchbyQuery){
                                $query->where($searchbyQuery, 'like', "%{$searchQuery}%");
                            });
                        })->count(),