app/Http/Controllers/Admin/DocumentController.php

select * from `documents` where `documents`.`id` = 1 limit 1
select `id`, `name`, `office` from `clients` where `clients`.`id` in (1)
---
    public function archive(Document $document)
    {
        $validated = request()->validate([
            'remarks' => 'required',
        ]);

        $setStatus = ([
            'status' => DocumentStatus::ARCHIVED,
        ]);

        $document->update($setStatus);

        $setTransactionStatus = ([
            'status' => TransactionStatus::COMPLETED,
            'remarks' => $validated['remarks'],
        ]);

        $update_last_transaction = Transaction::where('document_id', $document->id)->orderBy('id', 'desc')->first();

        $update_last_transaction->update($setTransactionStatus);

        return Document::with('client:id,name,office')->where('id', $document->id)->limit(1)->get()
            ->map(fn($doc) => [
                'id' => $doc->id,
                'date_received' => $doc->date_received,
                'client' => [
                    'name' => $doc->client->name,
                    'office' => $doc->client->office,
                ],
                'title' => $doc->title,
                'description' => $doc->description,
                'remarks' => $doc->remarks,
                'status' => [
                    'name' => $doc->status->name,
                    'color' => $doc->status->color(),
                ],
                'last_assigned' => $document->last_assignment,
                'last_transaction_type' => $document->last_transaction_type,
                'type' => $doc->type->name,
                'days_active' => $doc->days_active,
            ]);