app/Http/Controllers/Admin/EmployeeController.php

select * from `employees` order by `created_at` desc
---
    public function index(){
        return Employee::latest()->get();