app/Http/Controllers/Admin/SettingController.php

select `value`, `key` from `settings`
---
    public function index(){
        $settings = Setting::pluck('value','key')->toArray();