app/Http/Controllers/Admin/TransactionController.php

select * from `transactions` where `document_id` = 4 order by `created_at` desc limit 15 offset 0
select `id`, `emp_name` from `employees` where `employees`.`id` in (1, 15, 16, 18)
select `id`, `name` from `users` where `users`.`id` in (1, 2, 5)
select count(*) as aggregate from `transactions` where `document_id` = 4
---
    public function transactions(Document $document)
    {
        $transactions = Transaction::query()
            ->with('document')
            ->with('employee:id,emp_name')
            ->with('user:id,name')
            ->where('document_id', $document->id)
            ->latest()->paginate()
            ->through(fn($transaction) => [
                'id' => $transaction->id,
                'date_assigned' => $transaction->formatted_date_assigned,
                'assigned_to' => $transaction->employee,
                'action' => $transaction->action,
                'status' => [
                    'name' => $transaction->status->name,
                    'color' => $transaction->status->color(),
                ],
                'attachment' => $transaction->document_file,
                'routed_by' => $transaction->user,
                'type' => [
                    'name' => $transaction->type?->name,
                    'color' => $transaction->type?->color(),
                ],
                'remarks' => $transaction->remarks,